# Different ways to create the Data Frame

In [2]:
import numpy as np
import pandas as pd

### From a Dictionary of Lists

In [4]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}

df = pd.DataFrame(data)

df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### From a List of Dictionaries

In [5]:
data = [
    {'Name': 'Alice', 'Age': 25},
    {'Name': 'Bob', 'Age': 30},
    {'Name': 'Charlie', 'Age': 35}
]
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### From a List of Lists (with Column Names)

In [6]:
data = [
    ['Alice', 25],
    ['Bob', 30],
    ['Charlie', 35]
]
df = pd.DataFrame(data, columns=['Name', 'Age'])

df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### From a Dictionary of Series

In [9]:
data = {
    'Name': pd.Series(['Alice', 'Bob', 'Charlie']),
    'Age': pd.Series([25, 30, 35])
}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### From a Numpy Array

In [10]:
import numpy as np

arr = np.array([['Alice', 25], ['Bob', 30], ['Charlie', 35]])
df = pd.DataFrame(arr, columns=['Name', 'Age'])

df

      Name Age
0    Alice  25
1      Bob  30
2  Charlie  35

In [11]:
names = ['A','B','C','D','E']
ages = [10,12,15,10,11]
marks = [25,20,21,19,22]

In [20]:
df = pd.DataFrame(
    data={
    'name':names,
    'age':ages,
    'marks':marks
} )

df

  name  age  marks
0    A   10     25
1    B   12     20
2    C   15     21
3    D   10     19
4    E   11     22